"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Seçili Olan Klasöre Çıkar";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Masaüstüne Çıkar";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Şuraya Çıkar...";
